# Pandas Series and Index Objects

In [3]:
import pandas as pd

In [4]:
titanic=pd.read_csv('titanic.csv')

In [5]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   sex       891 non-null    object
 3   age       714 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [6]:
titanic['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [7]:
type(titanic['age'])

pandas.core.series.Series

In [8]:
titanic['age'].equals(titanic.age)

True

In [9]:
titanic.shape

(891, 9)

In [10]:
titanic.age.index

RangeIndex(start=0, stop=891, step=1)

In [11]:
len(titanic.age)

891

In [12]:
titanic.age.to_frame()

      age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]


# Analyize Numberical Series

In [13]:
titanic.age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [14]:
titanic.age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [15]:
titanic.age.count()

714

In [16]:
titanic.age.sum()
sum(titanic.age)

nan

In [17]:
titanic.age.size

891

In [18]:
len(titanic.age)

891

In [19]:
titanic.age.mean 
# for total titanic.age.mean()

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64>

In [20]:
titanic.age.median()

28.0

In [21]:
age=titanic.age.to_frame()

In [31]:
titanic.age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [33]:
titanic.age.nunique(dropna=False)

89

In [37]:
titanic.age.value_counts(sort=True)

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: age, Length: 88, dtype: int64

In [39]:
titanic.age.value_counts(dropna=True)

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: age, Length: 88, dtype: int64

In [40]:
titanic.age.value_counts(ascending=False)

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: age, Length: 88, dtype: int64

In [45]:
titanic.age.value_counts(sort=True,ascending=False,dropna=False, normalize=True).to_frame()

            age
NaN    0.198653
24.00  0.033670
22.00  0.030303
18.00  0.029181
28.00  0.028058
...         ...
36.50  0.001122
55.50  0.001122
0.92   0.001122
23.50  0.001122
74.00  0.001122

[89 rows x 1 columns]

In [47]:
30/titanic.age.count().round()

0.04201680672268908

In [48]:
titanic.age.value_counts(sort=True,ascending=False,dropna=False, normalize=True,bins=20).to_frame()

                       age
(20.315, 24.294]  0.109989
(24.294, 28.273]  0.095398
(28.273, 32.252]  0.094276
(16.336, 20.315]  0.088664
(32.252, 36.231]  0.081930
(36.231, 40.21]   0.050505
(0.339, 4.399]    0.044893
(44.189, 48.168]  0.039282
(40.21, 44.189]   0.039282
(12.357, 16.336]  0.034792
(48.168, 52.147]  0.032548
(52.147, 56.126]  0.017957
(8.378, 12.357]   0.016835
(4.399, 8.378]    0.015713
(56.126, 60.105]  0.014590
(60.105, 64.084]  0.012346
(68.063, 72.042]  0.005612
(64.084, 68.063]  0.004489
(72.042, 76.021]  0.001122
(76.021, 80.0]    0.001122

In [ ]:
#Analyzie Non-numerical_series